In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan], "Ankara":[20,np.nan,25], "Izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [6]:
yeniVeri = {"Istanbul" : [30,29,np.nan], "Ankara":[20,np.nan,25], "Izmir" : [40,39,38],"Anlatya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [7]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Anlatya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [10]:
yeniDataFrame.dropna(axis=1, thresh=2) ## 2 ve üzeri nan olan kolonları almıyor

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Anlatya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [15]:
maasSozluk = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Çalışsan İsmi":["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
             "Maas":[100,150,200,300,400,500]}

In [16]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [17]:
maasDataFrame

   Departman Çalışsan İsmi  Maas
0    Yazılım         Ahmet   100
1    Yazılım        Mehmet   150
2  Pazarlama          Atil   200
3  Pazarlama         Burak   300
4      Hukuk        Zeynep   400
5      Hukuk         Fatma   500

In [25]:
groupObjesi = maasDataFrame.groupby("Departman")

In [30]:
groupObjesi.min()

          Çalışsan İsmi  Maas
Departman
Hukuk             Fatma   400
Pazarlama          Atil   200
Yazılım           Ahmet   100

In [31]:
groupObjesi.max()

          Çalışsan İsmi  Maas
Departman
Hukuk            Zeynep   500
Pazarlama         Burak   300
Yazılım          Mehmet   150

In [32]:
groupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0